
#include <iostream>
#define _CRT_SECURE_NO_WARNINGS
#include <math.h>
#include < stdio.h >
// Лабораторна робота 1
// Виконав Кот Олександр Анатолійович, 3 курс бакалавра ННІВТ, біолог
// Варіант 2
// 1)	Створити змінні типу int з іменами L, S.
// 
// 
// 2)	Створити константу типу double з ім’ям R0(питомий опір), якій присвоїти 
// значення 1.68×10 - 8 (в одиницях Ом×м).
// 
// 
// 3)	Використовуючи функцію scanf() задати значення змінним L та S.
// 
// 
// 4)	Розрахувати опір дроту довжиною L та площею поперечного перері - зу S 
// за формулою R = R0·L / S, записавши результат у змінній типу double з ім’ям R.
// 
// 
// 5)	Використовуючи функцію printf() вивести на екран : формулу для розрахунку 
// опору R, значення опору з точністю 3 знаки після коми та ро - змірність отриманої величини.
// 
// 
// 6)	Продемонструвати роботу програми викладачу.

// Хід роботи:
int main()
{	// 1)	Створити змінні типу int з іменами L, S.
	int L, S; 


	// 2)	Створити константу типу double з ім’ям R0(питомий опір), якій присвоїти 
	// значення 1.68×10 - 8 (в одиницях Ом×м).
	const double R0 = 1.68e-8;


	// 3)	Використовуючи функцію scanf() задати значення змінним L та S.
	printf_s("Enter the length of the wire L (in meters): ");
	scanf_s("%d", &L);
	printf_s("Enter the cross-sectional area S (in square meters): ");
	scanf_s("%d", &S);


	// 4)	Розрахувати опір дроту довжиною L та площею поперечного перері - зу S 
	// за формулою R = R0·L / S, записавши результат у змінній типу double з ім’ям R.
	double R = R0 * L / S; 
	

	// 5)	Використовуючи функцію printf() вивести на екран : формулу для розрахунку 
	// опору R, значення опору з точністю 3 знаки після коми та розмірність отриманої величини.
	// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!Помилки тут немає, просто значення настільки маленьке виходить, що 3 знаки після коми не вистачає, спробуйте використати більше L та меншу S!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
	printf_s("R = R0 * L / S = %.3f(Om*m)", R); 

	// 6)	Продемонструвати роботу програми викладачу.
	return 0;
}
